//=============================================================================
//
// ガイドUIクラス <Guide.h>
// Author : 初 景新
//
//=============================================================================
#ifndef _UI_GUIDE_CLASS_INCLUDE_H_
#define _UI_GUIDE_CLASS_INCLUDE_H_

#include "source/class/Aclass_object.h"
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define UI_TEX_GUIDE  "data/TEXTURE/UI/Guide.png"

//*****************************************************************************
// クラス設計
//*****************************************************************************
class UICGuide : public class_ObjectA
{
	D3DXCOLOR TexColor;

public:
	bool Active;
	UICGuide() {};
	~UICGuide() {};

	void Init();
	int Update();
	void Draw();
	void Uninit();

	void SetGuideUI(D3DXVECTOR3 pos);

private:

};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************



#endif
