//=============================================================================
//
// リザルト画面処理 [result.h]
// Author : 初 景新
//
//=============================================================================
#ifndef _RESULT_INCLUDE_H_
#define _RESULT_INCLUDE_H_


#include "main.h"


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
