//=============================================================================
//
// ステージセレクト処理 [StageSelect.h]
// Author : 初 景新
//
//=============================================================================
#ifndef _STAGESELECT_INCLUDE_H_
#define _STAGESELECT_INCLUDE_H_

#include "Library\ObjectBase2D.h"
#include "main.h"

//*****************************************************************************
// クラス設計
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitStageSelect(void);
void UninitStageSelect(void);
void UpdateStageSelect(void);
void DrawStageSelect(void);

#endif
